# This script contains the following:
- Import libraries
- Load datasets
- Checking import & dataframes
- Merging orders & orders_prior data frames
- Export

# Import libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Load datasets

In [3]:
# Define paths and filenames
path = r'/Users/macbook/Dropbox/Mac/Documents/Pro/Data Analyst/Course_Career foundry/A4_Python/2023.08_Instacart basket analysis/02_data'
orders_filename = 'orders_checked.csv'
orders_prior_filename = 'orders_products_prior.csv'

# Construct full file paths
orders_file_path = os.path.join(path,'prepared data', orders_filename)
orders_priors_file_path = os.path.join(path, 'original data', orders_prior_filename)

# Import dataframes
df_ords = pd.read_csv(orders_file_path, index_col=False)
df_ords_prior = pd.read_csv(orders_priors_file_path, index_col=False)

# Checking import & dataframes

In [4]:
# checking dataframe
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,number_order_client,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

In [8]:
# Dropping useless columns 
df_ords = df_ords.drop(columns=['Unnamed: 0.1','Unnamed: 0'])
df_ords

,order_id,user_id,number_order_client,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [5]:
# checking dataframe
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [9]:
# Checking order's dataframe shape
df_ords.shape

(3421083, 6)

In [10]:
# Checking order prior's dataframe shape
df_ords_prior.shape

(32434489, 4)

# Merging orders & orders_prior data frames

In [11]:
# Perform an outer merge on df_ords and df_ords_prior, using the 'order_id' column as the key
df_merged_large = df_ords.merge(df_ords_prior, on='order_id', indicator=True, how='outer')

In [12]:
# Checking the merging
df_merged_large['_merge'].value_counts()

both          32434489
left_only       206209
right_only           0
Name: _merge, dtype: int64

In [13]:
# Checking shape
df_merged_large.shape

(32640698, 10)

# Exporting

In [ ]:
# exporting in pickle format
df_merged_large.to_pickle(os.path.join(path,'prepared data', 'orders_products_combined.pkl'))